const Asena = require('../events');
const Config = require('../config');
const {MessageType, MessageOptions, Mimetype} = require('@adiwajshing/baileys');
const axios = require('axios');
//language
const Language = require('../language');
const Lang = Language.getString('scrapers');

if (Config.WORKTYPE == 'public') {
Asena.addCommand({pattern: 'olpass', fromMe: false, desc: Lang.UP}, (async (message, match) => {

    var r_text = new Array ();
    
    
   r_text[0] = "https://drive.google.com/u/1/uc?id=1Xx9V1yP_xQ46QWDiiI7hdIpn5IX70DKO&export=download";
   r_text[1] = "https://drive.google.com/u/1/uc?id=1Xx9V1yP_xQ46QWDiiI7hdIpn5IX70DKO&export=download";
   r_text[2] = "https://drive.google.com/u/1/uc?id=1Xx9V1yP_xQ46QWDiiI7hdIpn5IX70DKO&export=download";
    
        
     var i = Math.floor(3*Math.random())

    var respoimage = await axios.get(`${r_text[i]}`, { responseType: 'arraybuffer' })

    await message.sendMessage (Buffer.from (respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `*◄ ●●●●●● ◉ᴀᴍᴀᴢᴏɴᴇ◉ ●●●●●●►*

*╔════════════════╗*
*╠▷   O/L PASS PAPERS   ◁╣*
*╚════════════════╝*

මෙමගින් ඔබට සාමාන්‍යපෙල විභාගයේ පසුගිය අවුරුදු පහක ප්‍රශ්න පත්‍ර ලබාදේ 

*⚜ප්‍රධාන විශයන් හයෙහි⚜*

*📌සිංහල විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15sin
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : සිංහල

*📍විධානය* : .16sin
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : සිංහල

*📍විධානය* : .17sin
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : සිංහල

*📍විධානය* : .18sin
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : සිංහල

*📍විධානය* : .19sin
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : සිංහල



*📌ඉතිහාසය විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15his
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : ඉතිහාසය

*📍විධානය* : .16his
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : ඉතිහාසය

*📍විධානය* : .17his
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : ඉතිහාසය

*📍විධානය* : .18his
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : ඉතිහාසය

*📍විධානය* : .19his
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : ඉතිහාසය



*📌විද්‍යාව විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15sc
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : විද්‍යාව

*📍විධානය* : .16sc
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : විද්‍යාව

*📍විධානය* : .17sc
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : විද්‍යාව

*📍විධානය* : .18sc
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : විද්‍යාව

*📍විධානය* : .19sc
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : විද්‍යාව



*📌ගණිතය විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15maths
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : ගණිතය

*📍විධානය* : .16maths
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : ගණිතය

*📍විධානය* : .17maths
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : ගණිතය

*📍විධානය* : .18maths
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : ගණිතය

*📍විධානය* : .19maths
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : ගණිතය



*📌බුද්ධ ධර්මය *
»»—- ★ ★ —-««

*📍විධානය* : .15bu
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : බුද්ධ ධර්මය

*📍විධානය* : .16bu
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : බුද්ධ ධර්මය

*📍විධානය* : .17bu
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : බුද්ධ ධර්මය

*📍විධානය* : .18bu
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : බුද්ධ ධර්මය

*📍විධානය* : .19bu*
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : බුද්ධ ධර්මය



*📌ENGLISH SUBJECT විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15en
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : ENGLISH SUBJECT

*📍විධානය* : .16en
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : ENGLISH SUBJECT

*📍විධානය* : .17en
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : ENGLISH SUBJECT

*📍විධානය* : .18en
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : ENGLISH SUBJECT

*📍විධානය* : .19en
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : ENGLISH SUBJECT
»»—- ★ MAIN SUBJECTS END ★ —-««




»»—- ★ II කාණ්ඩයේ විශයන් ★ —-««

*📌ENGLISH LITERATURE විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15liten
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : ENGLISH LITERATURE

*📍විධානය* : .16liten
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : ENGLISH LITERATURE

*📍විධානය* : .17liten
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : ENGLISH LITERATURE

*📍විධානය* : .18liten
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : ENGLISH LITERATURE

*📍විධානය* : .19liten
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : ENGLISH LITERATURE



*📌සිංහල සාහිත්‍ය රසාස්වාදය විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15silit
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : සිංහල සාහිත්‍ය රසාස්වාදය

*📍විධානය* : .16silit
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : සිංහල සාහිත්‍ය රසාස්වාදය

*📍විධානය* : .17silit
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : සිංහල සාහිත්‍ය රසාස්වාදය

*📍විධානය* : .18silit
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : සිංහල සාහිත්‍ය රසාස්වාදය

*📍විධානය* : .19silit
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : සිංහල සාහිත්‍ය රසාස්වාදය



*📌දෙමළ සාහිත්‍ය (II කාණ්ඩය) විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15tlit
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : දෙමළ සාහිත්‍ය (II කාණ්ඩය)

*📍විධානය* : .16tlit
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : දෙමළ සාහිත්‍ය (II කාණ්ඩය)

*📍විධානය* : .17tlit
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : දෙමළ සාහිත්‍ය (II කාණ්ඩය)

*📍විධානය* : .18tlit
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : දෙමළ සාහිත්‍ය (II කාණ්ඩය)




*📌චිත්‍ර විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15art
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : චිත්‍ර

*📍විධානය* : .16art
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : චිත්‍ර

*📍විධානය* : .17art
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : චිත්‍ර

*📍විධානය* : .18art
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : චිත්‍ර

*📍විධානය* : .19art
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : චිත්‍ර



*📌නැටුම් (බාරතීය) විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15danceb
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (බාරතීය)

*📍විධානය* : .16danceb
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (බාරතීය)

*📍විධානය* : .17danceb
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (බාරතීය)

*📍විධානය* : .18danceb
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (බාරතීය)

*📍විධානය* : .19danceb
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (බාරතීය)


*📌නැටුම් (දේශීය) විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15danceo
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (දේශීය)

*📍විධානය* : .16danceo
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (දේශීය)

*📍විධානය* : .17danceo
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (දේශීය)

*📍විධානය* : .18danceo
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (දේශීය)

*📍විධානය* : .19danceo
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : නැටුම් (දේශීය)



*📌නාට්‍ය හා රංග කලාව විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15drama
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : නාට්‍ය හා රංග කලාව

*📍විධානය* : .16drama
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : නාට්‍ය හා රංග කලාව

*📍විධානය* : .17drama
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : නාට්‍ය හා රංග කලාව

*📍විධානය* : .18drama
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : නාට්‍ය හා රංග කලාව

*📍විධානය* : .19drama
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : නාට්‍ය හා රංග කලාව



*📌පෙරදිග සංගීතය විශය*
»»—- ★ ★ —-««

*📍විධානය* : .15mus1
*🔆අවුරුද්ද* : 2015
*📃ප්‍රශ්න පත්‍රය* : පෙරදිග සංගීතය

*📍විධානය* : .16mus1
*🔆අවුරුද්ද* : 2016
*📃ප්‍රශ්න පත්‍රය* : පෙරදිග සංගීතය

*📍විධානය* : .17mus1
*🔆අවුරුද්ද* : 2017
*📃ප්‍රශ්න පත්‍රය* : පෙරදිග සංගීතය

*📍විධානය* : .18mus1
*🔆අවුරුද්ද* : 2018
*📃ප්‍රශ්න පත්‍රය* : පෙරදිග සංගීතය

*📍විධානය* : .19mus1
*🔆අවුරුද්ද* : 2019
*📃ප්‍රශ්න පත්‍රය* : පෙරදිග සංගීතය
»»—- ★ II BRACKET SUBJECTS END ★ —-««


KAVISHKA SANDARUWAN
*◄●●●●●● ◉ᴀᴍᴀᴢᴏɴᴇ◉ ●●●●●●►*
`}) 

 }));
}
